{"keras_version": "2.0.6", "config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "batch_input_shape": [null, 66, 200, 3], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_146", "dtype": "float32", "kernel_size": [5, 5], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [2, 2], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 24, "padding": "valid", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_147", "kernel_size": [5, 5], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [2, 2], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 36, "padding": "valid", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_148", "kernel_size": [5, 5], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [2, 2], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 48, "padding": "valid", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_149", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "padding": "valid", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_150", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "padding": "valid", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_30"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_146", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 1160, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_89", "rate": 0.8}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_147", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 100, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_90", "rate": 0.8}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_148", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 50, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_91", "rate": 0.8}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_149", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_150", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}