{"keras_version": "2.0.6", "config": [{"config": {"kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "batch_input_shape": [null, 66, 200, 3], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_191", "dtype": "float32", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "padding": "valid", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_1", "activation": "elu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_10"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_192", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "padding": "valid", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_2", "activation": "elu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_11"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_193", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 48, "padding": "valid", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_3", "activation": "elu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_12"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_194", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "padding": "valid", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_4", "activation": "elu"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_195", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 84, "padding": "valid", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_5", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_39"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_191", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 1024, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_6", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_118", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_192", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_7", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_7", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_119", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_193", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_8", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_8", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_120", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_194", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_9", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_9", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_121", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_195", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_10", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_10", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_122", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_196", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_11", "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "center": true, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_11", "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_123", "rate": 0.8}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_197", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}