{"keras_version": "2.0.6", "config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "batch_input_shape": [null, 66, 200, 3], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_176", "dtype": "float32", "kernel_size": [5, 5], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "padding": "valid", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_177", "kernel_size": [5, 5], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 24, "padding": "valid", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_178", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "padding": "valid", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_7"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_179", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 48, "padding": "valid", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_8"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_180", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "strides": [1, 1], "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "padding": "valid", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_9"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_36"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_176", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_108", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_177", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_109", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_178", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_110", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_179", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_111", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_180", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}